InformationRegisters/фин_НастройкаСоответствийСтатейБюджетовПозициямОтчетовПоФинансовымБюджетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>фин_НастройкаСоответствийСтатейБюджетовПозициямОтчетовПоФинансовымБюджетам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.фин_СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлассификаторБюджетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_КлассификаторБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлассификаторПозицииОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.фин_КлассификаторСтатейБюджетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/фин_КлассификаторБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_КлассификаторБюджетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БюджетАдминистративныхРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетДвиженияДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетДоходовИРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетЗакупок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетЗакупокДляВспомогательныхПроизводств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетЗакупокНаОбслуживаниеТранспорта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетЗакупокНаОфисныеНужды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетПоступленияДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетЗакупокОргтехникиКомплектующихИПрограммногоОбеспечения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетЗакупокСырьяИМатериалов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетЗакупокТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетКоммерческихРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетНакладныхПроизводственныхРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетПоБалансовомуЛисту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетПроекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетПрямыхЗатратНаОплатуТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетПрямыхПроизводственныхЗатрат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетРасчетовСКредиторами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетСебестоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетРасходовПоЗаработнойПлате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетНалогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетДвиженияДебиторскойЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетКапитальныхВложений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/фин_НастройкаСоответствийСтатейБюджетовПозициямОтчетовПоФинансовымБюджетам/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокБюджетов.Добавить(Перечисления.фин_КлассификаторБюджетов.БюджетДвиженияДенежныхСредств);
	СписокБюджетов.Добавить(Перечисления.фин_КлассификаторБюджетов.БюджетДоходовИРасходов);
	СписокБюджетов.Добавить(Перечисления.фин_КлассификаторБюджетов.БюджетПоБалансовомуЛисту);
	ЗаполнитьСтатьи();
	КодСтроки = ОпределитьКодСтроки(Запись.КлассификаторБюджетов,Запись.КлассификаторПозицииОтчета);
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторБюджетовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокБюджетов;
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторБюджетовПриИзменении(Элемент)
	ЗаполнитьСтатьи();
	Если СписокСтатей.НайтиПоЗначению(Запись.КлассификаторПозицииОтчета)=Неопределено Тогда
		Запись.КлассификаторПозицииОтчета = ПредопределенноеЗначение("Перечисление.фин_КлассификаторСтатейБюджетов.ПустаяСсылка");
	КонецЕсли;
	КодСтроки = ОпределитьКодСтроки(Запись.КлассификаторБюджетов,Запись.КлассификаторПозицииОтчета);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьи()
	СписокСтатей.Очистить();
	ТаблицаСтатей = фин_УправлениеБюджетнойМоделью.ПолучитьТаблицуПостатейногоСоставаБюджетов(,Запись.КлассификаторБюджетов);
	СтрокиОтдельныхСтатей = ТаблицаСтатей.НайтиСтроки(Новый Структура("ЭтоГруппа",Ложь));
	Для Каждого СтрокаСтатья Из СтрокиОтдельныхСтатей Цикл
		Представление = Строка(СтрокаСтатья.Статья);
		Представление = ОпределитьКодСтроки(Запись.КлассификаторБюджетов,СтрокаСтатья.Статья) + ". "+Представление;
		СписокСтатей.Добавить(СтрокаСтатья.Статья,Представление);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КлассификаторПозицииОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокСтатей;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьКодСтроки(КлассификаторБюджетов,Статья)
	Если КлассификаторБюджетов=Перечисления.фин_КлассификаторБюджетов.БюджетДвиженияДенежныхСредств Тогда
		Возврат Отчеты.фин_ПрогнозныйОтчетОДвиженииДенег.КодСтрокиОтчета(Статья);
	ИначеЕсли КлассификаторБюджетов=Перечисления.фин_КлассификаторБюджетов.БюджетДоходовИРасходов Тогда
		Возврат Отчеты.фин_ПрогнозныйОтчетОДоходахИРасходах.КодСтрокиОтчета(Статья);
	КонецЕсли;
	Возврат "";
КонецФункции

&НаКлиенте
Процедура КлассификаторПозицииОтчетаПриИзменении(Элемент)
	КодСтроки = ОпределитьКодСтроки(Запись.КлассификаторБюджетов,Запись.КлассификаторПозицииОтчета);
КонецПроцедуры
